## Циклы

С помощью циклов мы можем выполнить блок кода несколько раз. Циклы в C# делятся на циклы с предусловием (for, foreach, while) и цикл с постусловием (do ... while). В первом случае условие проверяется перед началом итерации цикла, во втором после. Это означает что цикл с постусловием выполняется как минимум один раз, а цикл с предусловием может не выполниться ни разу.   

### Цикл for
...

### Цикл while

Цикл while выполняет свое тело до тех пор пока истинно условие указанное в скобках. 

```csharp
string[] names = new string[] {"Добрыня", "Ольга", "Святосляв", "Милослава"};
int i = 0;
while (i < names.Length)
{
	Console.WriteLine(names[i]);
	i++;
}
```

Алгоритм выполнения цикла while:

1. Проверить условие цикла. Если условие ложно, то завершить его выполнение. Из этого следует, что цикл while может не выполниться ни разу;
2.	Выполнить тело цикла;
3.	Перейти к пункту №1

### Цикл do { } while

Цикл do {} while называют циклом с пост-условием т.к. условие выхода из цикла проверяется в конце итерации. Это означает что данный цикл выполняется хотя бы один раз. Алгоритм выполнения цикла do {} while:

1.	Выполнить тело цикла
2.	Если условие внутри while истинно, то перейти к пункту №1, иначе закончить цикл.

Пример:

```csharp
string[] names = {"Добрыня", "Ольга", "Святосляв", "Милослава"};
int i = 0;
do
{
	Console.WriteLine(names[i++]);
}
while (i < names.Length);
```

### Цикл foreach
Цикл foreach предназначен для перебора всех элементов коллекции по порядку их расположения.

### Ключевые слова break и continue
Ключевое слово break прерывает выполнение цикла и передает управление на следующую строку после цикла.
Ключевое слово continue начинает следующую итерацию цикла.


### Задания для самопроверки
- Напишите программа которая предлагает "купить слона". Она должна уговаривать пользователя пока он не введет "да", "согласен" или "хорошо".

- Напишите программу, которая выводит числа от 1 до 100 (включительно). Если число делится на 3, выведите Fizz вместо числа. Если оно делится на 5, выведите Buzz. Если оно делится как на 3, так и 5, выведите FizzBuzz. При выполнении задания попробуйте применить тернарный оператор ?:

- Найдите и выведите на экран простые числа от 1 до 100

- Бубруйск — маленький город, там всего одна трамвайная линия, а номера всех трамвайных билетов содержат четыре цифры. Жители Бубруйска считают, что трамвайный билет счастливый, если первые две его цифры в сумме дают то же число, что и последние две цифры. Распечатайте все счастливые номера.

- Выведите таблицу умножения для чисел от 1 до 9 в виде таблицы
	   |  1 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 |  10 |
	-------------------------------------------------------
	 1 |  1 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 |  10 |
	 2 |  2 |  4 |  6 |  8 | 10 | 12 | 14 | 16 | 18 |  20 |
	 3 |  3 |  6 |  9 | 12 | 15 | 18 | 21 | 24 | 27 |  30 |
	 4 |  4 |  8 | 12 | 16 | 20 | 24 | 28 | 32 | 36 |  40 |
	 5 |  5 | 10 | 15 | 20 | 25 | 30 | 35 | 40 | 45 |  50 |
	 6 |  6 | 12 | 18 | 24 | 30 | 36 | 42 | 48 | 54 |  60 |
	 7 |  7 | 14 | 21 | 28 | 35 | 42 | 49 | 56 | 63 |  70 |
	 8 |  8 | 16 | 24 | 32 | 40 | 48 | 56 | 64 | 72 |  80 |
	 9 |  9 | 18 | 27 | 36 | 45 | 54 | 63 | 72 | 81 |  90 |
	10 | 10 | 20 | 30 | 40 | 50 | 60 | 70 | 80 | 90 | 100 |
	-------------------------------------------------------
